Repository: codacy-open-source-project-scans/gawk
Catalog: po/xhe.po
Languages: he

source: attempt to use scalar parameter `%s' as an array
he: נסיון שימוש בפרמטר סקלרי `%s' כאילו היה מערך

source: attempt to use array `%s' in a scalar context
he: נסיון שימוש במערך `%s' בקונטקסט הדורש סקלאר

source: subscript of array `%s' is null string
he: שימוש במחרוזת ריקה כמציין מערך `%s'

source: delete: index `%s' not in array `%s'
he: delete: מערך `%2$s' אינו מכיל מציין `%1$s'

source: %s: empty (null)
he: %s: ריק (מאופס)

source: %s: empty (zero)
he: %s: ריק (אפס)

source: %s: is parameter
he: %s: ינו פרמטר

source: %s: array_ref to %s
he: %s: הפניה (array_ref) ל-%s

source: `%s' is a built-in function, it cannot be redefined
he: `%s' הינה פונקציה מובנית, אין לשנות את הגדרתה

source: regexp constant `/%s/' looks like a C comment, but is not
he: ביטוי רגולרי '/%s/` נראה כמו הערה בשפת C, אך אינו הערה

source: `nextfile' is a gawk extension
he: 'nextfile` הינו הרחבה ספציפית ל-gawk

source: `return' used outside function context
he: שימוש ב-`return` שלא בקונטקסט של פונקציה

source: plain `print' in BEGIN or END rule should probably be `print ""'
he: `print' פשוט בכללי BEGIN או END צריך מן הסתם להיות `print ""'

source: `delete array' is a gawk extension
he: `delete array' הינו הרחבה ספציפית ל-gawk

source: regular expression on right of assignment
he: ביטוי רגולרי בצד ימין של הוראת השמת ערך

source: regular expression on left of `~' or `!~' operator
he: ביטוי רגולרי משמאל לאופרטור '~` או '~!`

source: regular expression on right of comparison
he: ביטוי רגולרי בצד ימין של השוואה

source: use of non-array as array
he: שימוש בדבר שהוא לא מארך כמערך

source: can't open source file `%s' for reading (%s)
he: תקלה (%2$s) בפתיחת קובץ מקור `%1$s' לשם קריאתו

source: reason unknown
he: מסיבה בלתי-ידועה

source: empty filename after @include
he: שם קובץ ריק אחרי @include

source: empty program text on command line
he: תכנית ריקה התקבלה משורת הפקודה

source: can't read sourcefile `%s' (%s)
he: תקלה (%2$s) בקריאה מקובץ מקור `%1$s'

source: source file `%s' is empty
he: קובץ מקור `%s' הינו ריק

source: source file does not end in newline
he: קובץ המקור אינו מסתיים בתו סוף-שורה

source: unterminated regexp ends with `\' at end of file
he: ביטוי רגולרי בלתי-גמור מסתיים ב-`\' בסף הקובץ

source: %s: %d: tawk regex modifier `/.../%c' doesn't work in gawk
he: %s: %d: משנה ביטוי רגולרי `/.../%c' של tawk לא עובד ב-gawk

source: tawk regex modifier `/.../%c' doesn't work in gawk
he: משנה ביטוי רגולרי `/.../%c' של tawk לא עובד ב-gawk

source: unterminated regexp
he: ביטוי רגולרי בלתי-גמור

source: unterminated regexp at end of file
he: ביטוי רגולרי בלתי-גמור בסוף הקובץ

source: use of `\ #...' line continuation is not portable
he: שימוש ב-`\ #...' כסימן להמשך שורה אינו פורטבילי

source: backslash not last character on line
he: לוכסן הפוך שאינו תו אחרון בשורה

source: POSIX does not allow operator `**='
he: POSIX אינו מרשה אופרטור `**='

source: old awk does not support operator `**='
he: awk ישן אינו תומך באופרטור `**='

source: POSIX does not allow operator `**'
he: POSIX אינו מרשה אופרטור `**'

source: old awk does not support operator `**'
he: awk ישן אינו תומך באופרטור `**'

source: operator `^=' is not supported in old awk
he: אופרטור `^=' אינו נתמך ב-awk ישן

source: operator `^' is not supported in old awk
he: אופרטור `^' אינו נתמך ב-awk ישן

source: unterminated string
he: מחרוזת בלתי-גמורה

source: invalid char '%c' in expression
he: תו שגוי '%c' בביטוי

source: `%s' is a gawk extension
he: `%s' הינה הרחבה ספציפית ל-gawk

source: `%s' is a Bell Labs extension
he: `%s' הינו הרחבה ספציפית ל-awk בגרסת מעבדות Bell Labs

source: POSIX does not allow `%s'
he: POSIX אינו מרשה `%s'

source: `%s' is not supported in old awk
he: `%s' אינו נתמך ב-awk ישן

source: `goto' considered harmful!
he: `goto' נחשב פגע-רע!

source: %d is invalid as number of arguments for %s
he: %2$s אינו יכול לקבל %1$d כמספר ארגומנטים

source: match: third argument is a gawk extension
he: ארגומנט שלישי של `match' הינו הרחבה ספציפית ל-gawk

source: %s: string literal as last arg of substitute has no effect
he: מחרוזת קבועה כארגומנט אחרון של `%s' אין לה שום תכלית

source: close: second argument is a gawk extension
he: ארגומנט שני של `close' הינו הרחבה ספציפית ל-gawk

source: use of dcgettext(_"...") is incorrect: remove leading underscore
he: שימוש שגוי ב-dcgettext("..."): יש לסלק מקף-תחתון שבקדמת ארגומנט

source: use of dcngettext(_"...") is incorrect: remove leading underscore
he: שימוש שגוי ב-dcngettext("..."): יש לסלק מקף-תחתון שבקדמת ארגומנט

source: function `%s': parameter #%d, `%s', duplicates parameter #%d
he: שמו של פרמטר מספר %2$d, `%3$s', זהה לפרמטר מספר %4$d בפונקציה `%1$s'

source: function `%s': parameter `%s' shadows global variable
he: פרמטר `%2$s' בפונקציה `%1$s' מאפיל על משתנה גלובלי

source: could not open `%s' for writing (%s)
he: תקלה (%2$s) בפתיחת `%1$s' לשם כתיבה

source: sending profile to standard error
he: פרופיל ביצוע נשלח לערוץ שגיאות תקני

source: %s: close failed (%s)
he: תקלה (%2$s) בעת סגירת `%1$s'

source: shadow_funcs() called twice!
he: shadow_funcs() נקראה פעמיים!

source: there were shadowed variables.
he: היו משתנים מאפילות

source: function `%s': can't use function name as parameter name
he: בפונקציה `%s': שם פונקציה אינו יכול לשמש כשם פרמטר

source: function name `%s' previously defined
he: פונקציה בשם `%s' כבר מוגדרת

source: function `%s' called but never defined
he: קריאה לפונקציה `%s' שאינה מוגדרת

source: regexp constant for parameter #%d yields boolean value
he: ביטוי רגולרי קבוע כפרמטר מספר d% מניב ערך בוליאני

source: division by zero attempted
he: נסיון חלוקה באפס

source: division by zero attempted in `%%'
he: נסיון חלוקה באפס ב-`%%'

source: %s to "%s" failed (%s)
he: תקלה (%3$s) בכתיבה ל-"%2$s" ע"י %1$s

source: standard output
he: יחידת פלט סטנדרטית

source: exp: received non-numeric argument
he: exp: ארגומנט אינו מספר

source: exp: argument %g is out of range
he: exp: ארגומנט %g אינו בתחום המותר

source: fflush: cannot flush: pipe `%s' opened for reading, not writing
he: fflush: לא ניתן לרוקן החוצץ: אפיק `%s' פתוח לקריאה, לא לכתיבה

source: fflush: cannot flush: file `%s' opened for reading, not writing
he: fflush: לא ניתן לרוקן החוצץ: קובץ `%s' פתוח לקריאה, לא לכתיבה

source: fflush: `%s' is not an open file, pipe or co-process
he: fflush: `%s' אינו קובץ פתוח, אפיק פתוח או תהליך מקביל

source: index: received non-string first argument
he: index: ארגומנט ראשון אינו מחרוזת

source: index: received non-string second argument
he: index: ארגומנט שני אינו מחרוזת

source: int: received non-numeric argument
he: int: ארגומנט אינו מספר

source: length: received non-string argument
he: length: ארגומנט אינו מחרוזת

source: log: received non-numeric argument
he: log: ארגומנט אינו מספר

source: log: received negative argument %g
he: log: נקרא עם ארגומנט שלילי %g

source: printf: no arguments
he: printf: אין אף ארגומנט

source: sqrt: received non-numeric argument
he: sqrt: ארגומנט אינו מספר

source: sqrt: called with negative argument %g
he: sqrt: נקרא עם ארגומנט שלילי %g

source: substr: non-integer length %g will be truncated
he: substr: אורך %g, שאינו מספר שלם, יקוצץ

source: substr: length %g too big for string indexing, truncating to %g
he: substr: אורך %g יותר מדי גדול, קוצץ ל-%g

source: substr: start index %g is invalid, using 1
he: substr: מציין התחלה %g הינו שגוי, הוחלף ב-1

source: substr: non-integer start index %g will be truncated
he: substr: ערכו של מציין התחלה %g ,שאינו מספר שלם, יקוצץ

source: substr: source string is zero length
he: substr: מחרוזת המקור הינה באורך אפס

source: strftime: format value in PROCINFO["strftime"] has numeric type
he: strftime: ארך נומרי בשביל פורמט ב-PROCINFO["strftime"]

source: strftime: received non-numeric second argument
he: strftime: ארגומנט שני אינו מספר

source: strftime: received non-string first argument
he: strftime: ארגומנט ראשון אינו מחרוזת

source: strftime: received empty format string
he: strftime: מחרוזת פורמט ריקה

source: mktime: received non-string argument
he: mktime: ארגומנט אינו מחרוזת

source: mktime: at least one of the values is out of the default range
he: mktime: לפחות אחד מהערכים אינו בתווך הנכון

source: `system' function not allowed in sandbox mode
he: פונקציית `system' אינה מותרת במצב ארגז חול

source: system: received non-string argument
he: system: ארגומנט אינו מחרוזת

source: reference to uninitialized variable `%s'
he: הפניה למשתנה בלתי-מתוחל `%s'

source: tolower: received non-string argument
he: tolower: ארגומנט אינו מחרוזת

source: toupper: received non-string argument
he: toupper: ארגומנט אינו מחרוזת

source: atan2: received non-numeric first argument
he: atan2: ארגומנט ראשון אינו מספר

source: atan2: received non-numeric second argument
he: atan2: ארגומנט שני אינו מספר

source: sin: received non-numeric argument
he: sin: ארגומנט אינו מספר

source: cos: received non-numeric argument
he: cos: ארגומנט אינו מספר

source: srand: received non-numeric argument
he: srand: ארגומנט אינו מספר

source: match: third argument is not an array
he: match: ארגומנט שלישי אינו מערך

source: lshift: received non-numeric first argument
he: lshift: ארגומנט ראשון אינו מספר

source: lshift(%lf, %lf): negative values will give strange results
he: lshift(%lf, %lf): ערכים שליליים יניבו תוצאות בלתי-צפויות

source: lshift(%lf, %lf): fractional values will be truncated
he: lshift(%lf, %lf): ערכים שבורים יקוצצו

source: lshift(%lf, %lf): too large shift value will give strange results
he: lshift(%lf, %lf): שיעור הזזה גדול מדי יניב תוצאות בלתי-צפויות

source: rshift: received non-numeric first argument
he: rshift: ארגומנט ראשון אינו מספר

source: rshift(%lf, %lf): negative values will give strange results
he: rshift(%lf, %lf): ערכים שליליים יניבו תוצאות בלתי-צפויות

source: rshift(%lf, %lf): fractional values will be truncated
he: rshift(%lf, %lf): ערכים שבורים יקוצצו

source: rshift(%lf, %lf): too large shift value will give strange results
he: rshift(%lf, %lf): שיעור הזזה גדול מדי יניב תוצאות בלתי-צפויות

source: and: received non-numeric first argument
he: and: ארגומנט ראשון אינו מספר

source: and(%lf, %lf): negative values will give strange results
he: and(%lf, %lf): ערכים שליליים יניבו תוצאות בלתי-צפויות

source: and(%lf, %lf): fractional values will be truncated
he: and(%lf, %lf): ערכים שבורים יקוצצו

source: or: received non-numeric first argument
he: or: ארגומנט ראשון אינו מספר

source: or(%lf, %lf): negative values will give strange results
he: or(%lf, %lf): ערכים שליליים יניבו תוצאות בלתי-צפויות

source: or(%lf, %lf): fractional values will be truncated
he: or(%lf, %lf): ערכים שבורים יקוצצו

source: xor: received non-numeric first argument
he: xor: ארגומנט ראשון אינו מספר

source: xor(%lf, %lf): negative values will give strange results
he: xor(%lf, %lf): ערכים שליליים יניבו תוצאות בלתי-צפויות

source: xor(%lf, %lf): fractional values will be truncated
he: xor(%lf, %lf): ערכים שבורים יקוצצו

source: compl: received non-numeric argument
he: compl: ארגומנט אינו מספר

source: compl(%lf): negative value will give strange results
he: compl(%lf): ערך שלילי יניב תוצאות בלתי-צפויות

source: compl(%lf): fractional value will be truncated
he: compl(%lf): ערך שבור יקוצץ

source: dcgettext: `%s' is not a valid locale category
he: dcgettext: `%s' אינו קטגוריית מיקום תקינה

source: unknown nodetype %d
he: nodetype %d לא מוכר

source: opcode %s not an operator or keyword
he: opcode %s לא מוכר

source: buffer overflow in genflags2str
he: גלישת חוצץ ב-genflags2str

source: # Function Call Stack:
he: # מחסנית הקריאות לפונקציות:

source: `IGNORECASE' is a gawk extension
he: `IGNORECASE' הינו הרחבה ספציפית ל-gawk

source: `BINMODE' is a gawk extension
he: `BINMODE' הינו הרחבה ספציפית ל-gawk

source: BINMODE value `%s' is invalid, treated as 3
he: ערך `%s' ל-BINMODE אינו נכון, משתמשים ב-3

source: bad `%sFMT' specification `%s'
he: `%2$s' אינו הגדרת `%1$sFMT' תקינה

source: turning off `--lint' due to assignment to `LINT'
he: מבטל `--lint' עקב השמת ערך ל-'LINT'

source: `PROCINFO["sorted_in"]' value is not recognized
he: ערך לא מוכר בשביל PROCINFO["sorted_in"]

source: can't use function name `%s' as variable or array
he: אין להשתמש בשם פונקציה `%s' כמשתנה או מערך

source: assignment is not allowed to result of builtin function
he: אין להציב ערך בתוצאה של פונקציה מובנית

source: reference to uninitialized argument `%s'
he: הפניה לארגומנט בלתי-מתוחל `%s'

source: attempt to field reference from non-numeric value
he: נסיון הפניה לשדה באמצעות ערך שאינו מספר

source: function `%s' called with more arguments than declared
he: קריאה לפונקציה `%s' עם יותר ארגומנטים מאשר בהכרזתה

source: unwind_stack: unexpected type `%s'
he: unwind_stack: סוג `%s' בלתי צפוי

source: division by zero attempted in `/='
he: נסיון חלוקה באפס ב-`/='

source: division by zero attempted in `%%='
he: נסיון חלוקה באפס ב-`%%='

source: assignment used in conditional context
he: שימוש בהשמה בקונטקסט של תנאי

source: statement has no effect
he: הוראה נטולת-תכלית

source: function called indirectly through `%s' does not exist
he: פונקציה שנקראת בעקיפין דרך `%s' אינה קיימת

source: function `%s' not defined
he: פונקציה `%s' אינה מוגדרת

source: Sorry, don't know how to interpret `%s'
he: מצטער, לא יודע איך לפרש `%s'

source: extensions are not allowed in sandbox mode
he: הרחבות אינן מותרות במצב ארגז חול

source: make_builtin: negative argument count for function `%s'
he: make_builitn: `%s': מספר ארגומנטים שלילי

source: function `%s': argument #%d: attempt to use array as a scalar
he: פןנקציה `%s': ארגומנט %d: שימוש שגוי במערך כסקאלר

source: Operation Not Supported
he: פעולה זו אינה נתמכת

source: NF set to negative value
he: NF קיבל ערך שלילי

source: split: second argument is not an array
he: הארגומנט השני של `split' אינו מערך

source: split: can not use the same array for second and fourth args
he: אםור להשתמש עם אותו מערך כארגומנטים שני ורביעי ל-`split'

source: split: null string for third arg is a gawk extension
he: מחרוזת מאופסת כארגמונט שלישי ל-`split' הינה הרחבה ספציפית ל-gawk

source: `FIELDWIDTHS' is a gawk extension
he: `FIELDWIDTHS' הינו הרחבה ספציפית ל-gawk

source: invalid FIELDWIDTHS value, for field %d, near `%s'
he: ערך לא טוב ל-FIELDWIDTHS, בשביל שדה %d, קרוב ל-`%s'

source: null string for `FS' is a gawk extension
he: מחרוזת מאופסת כ-`FS' הינה הרחבה ספציפית ל-gawk

source: command line argument `%s' is a directory: skipped
he: ארגומנט שורת הפקודה `%s' הוא ספרייה: דילוג

source: cannot open file `%s' for reading (%s)
he: תקלה (%2$s) בפתיחת קובץ `%1$s' לשם קריאתו

source: error reading input file `%s': %s
he: תקלה (%2$s) בקריאת קובץ `%1$s'

source: close of fd %d (`%s') failed (%s)
he: תקלה (%3$s) בסגירת `%2$s' (ערוץ קלט/פלט %1$d)

source: redirection not allowed in sandbox mode
he: בהפניית קלט/פלט אינו מותר במצב ארגז חול

source: expression in `%s' redirection only has numeric value
he: ביטוי בהפניית קלט/פלט `%s' מניב ערך נומרי בלבד

source: expression for `%s' redirection has null string value
he: ביטוי בהפניית קלט/פלט `%s' מניב מחרוזת ריקה

source: filename `%s' for `%s' redirection may be result of logical expression
he: בהפניית קלט/פלט `%s' שם קובץ `%s' עלול להיות תוצאה של ביטוי לוגי

source: unnecessary mixing of `>' and `>>' for file `%.*s'
he: שימוש מיותר הן ב-'>` והן ב-'>>` עבור קובץ `%.*s'

source: can't open pipe `%s' for output (%s)
he: תקלה (%2$s) בפתיחת אפיק `%1$s' לצורך פלט

source: can't open pipe `%s' for input (%s)
he: תקלה (%2$s) בפתיחת אפיק `%1$s' לצורך קלט

source: can't open two way pipe `%s' for input/output (%s)
he: תקלה (%2$s) בפתיחת `%1$s' כאפיק (pipe) דו-כיווני לצורך קלט/פלט

source: can't redirect from `%s' (%s)
he: תקלה (%2$s) בהפנייה מ-`%1$s'

source: can't redirect to `%s' (%s)
he: תקלה (%2$s) בהפנייה אל `%1$s'

source: reached system limit for open files: starting to multiplex file descriptors
he: הגעה למגבלת מערכת של מספר קבצים פתוחים; תחילת ריבוב ערוצי קלט/פלט

source: close of `%s' failed (%s).
he: תקלה (%2$s) בסגירת `%1s'

source: too many pipes or input files open
he: יותר מדי אפיקים (pipes) או קבצי קלט פתוחים בו-זמנית

source: close: second argument must be `to' or `from'
he: הארגומנט השני של `close' חייב להיות `to' או `from'

source: close: `%.*s' is not an open file, pipe or co-process
he: close: `%.*s' אינו קובץ פתוח, אפיק פתוח או תהליך מקביל

source: close of redirection that was never opened
he: סגירת הפנייה שלא נפתחה מעולם

source: close: redirection `%s' not opened with `|&', second argument ignored
he: close: הפנייה `%s' לא נפתחה ע"י `|&', הארגומנט השני הוזנח

source: failure status (%d) on pipe close of `%s' (%s)
he: תקלה (%3$s) בסגירת אפיק ל-`%2$s' (קוד תקלה %1$d)

source: failure status (%d) on file close of `%s' (%s)
he: תקלה (%3$s) בסגירת קובץ ל-`%2$s' (קוד תקלה %1$d)

source: no explicit close of socket `%s' provided
he: שקע `%s' (socket) לא נסגר במפורש

source: no explicit close of co-process `%s' provided
he: תהליך מקביל `%s' (co-process) לא נסגר במפורש

source: no explicit close of pipe `%s' provided
he: אפיק `%s' (pipe) לא נסגר במפורש

source: no explicit close of file `%s' provided
he: קובץ `%s' לא נסגר במפורש

source: error writing standard output (%s)
he: תקלה (%s) בכתיבה לערוץ פלט תקני

source: error writing standard error (%s)
he: תקלה (%s) בכתיבה לערוץ שגיאות תקני

source: pipe flush of `%s' failed (%s).
he: תקלה (%2$s) בריקון חוצץ של אפיק ל-`%1$s'

source: co-process flush of pipe to `%s' failed (%s).
he: תקלה (%2$s) בריקון חוצץ של אפיק תהליך מקביל ל-`%1$s'

source: file flush of `%s' failed (%s).
he: תקלה (%2$s) בריקון חוצץ נתוני קובץ של `%1$s'

source: remote host and port information (%s, %s) invalid
he: מדע לשם ויציאה למחשב מרוחק לא ולידי (%s, %s)

source: no (known) protocol supplied in special filename `%s'
he: פרוטוקול חסר או בלתי-מזוהה בשם קובץ מיוחד `%s'

source: special file name `%s' is incomplete
he: קובץ מיוחד `%s' אינו שלם

source: must supply a remote hostname to `/inet'
he: חובה להגדיר שם מחשב-מארח מרוחק עבור `/inet'

source: must supply a remote port to `/inet'
he: חובה להגדיר יציאה מרוחקת עבור `/inet'

source: TCP/IP communications are not supported
he: אין תמיכה בתקשורת TCP/IP

source: could not open `%s', mode `%s'
he: כשלון בפתיחת עבור `%s' אופן פעולה `%s'

source: close of stdout in child failed (%s)
he: תקלה (%s) בסגירת stdout בתכנית-בת

source: close of stdin in child failed (%s)
he: תקלה (%s) בסגירת stdin בתכנית-בת

source: moving pipe to stdout in child failed (dup: %s)
he: תקלה (dup: %s) בשכפול אפיק ל-stdout בתכנית-בת

source: moving pipe to stdin in child failed (dup: %s)
he: תקלה (dup: %s) בשכפול אפיק ל-stdin בתכנית-בת

source: restoring stdout in parent process failed
he: תקלה בשחזור stdout בתכנית-אב

source: restoring stdin in parent process failed
he: תקלה בשחזור stding בתכנית-אב

source: close of pipe failed (%s)
he: תקלה (%s) בסגירת אפיק

source: `|&' not supported
he: אין תמיכה ב-`|&'

source: cannot open pipe `%s' (%s)
he: תקלה (%2$s) בפתיחת אפיק `%1$s'

source: cannot create child process for `%s' (fork: %s)
he: תקלה (fork: %2$s) ביצירת תהליך לתכנית-בת `%1$s'

source: data file `%s' is empty
he: קובץ נתונים `%s' הינו ריק

source: multicharacter value of `RS' is a gawk extension
he: תמיכה במספר תוים בערך של `RS' הינה הרחבה ספציפית ל-gawk

source: out of memory
he: נגמר הזכרון

source: `-m[fr]' option irrelevant in gawk
he: מאפיין ']rf[m-` אינו רלוונטי עבור gawk

source: -m option usage: `-m[fr] nnn'
he: אופן שימוש במאפיין m-: 'nnn ]rf[m-`

source: %s: option `-W %s' unrecognized, ignored
he: nמאפיין %s'W-` אינו מוכר עבור תכנית,%s הוזנח

source: %s: option requires an argument -- %c
he: משתנה סביבה 'TCERROC_YLXISOP` מוגדר: מפעיל 'xisop--`

source: `--posix' overrides `--traditional'
he: 'xisop--` גובר על 'lanoitidart--`

source: `--posix'/`--traditional' overrides `--non-decimal-data'
he: 'lanoitidart--`/'xisop--` גובר על 'atad-lamiced-non--`

source: running %s setuid root may be a security problem
he: הרצת %s כ-toor diutes עלולה לפגוע באבטחת מידע

source: no program text at all!
he: טקסט של תכנית לא היה בנמצא כלל!

source: Usage: %s [POSIX or GNU style options] -f progfile [--] file ...
he: %s [GNU וא POSIX ןונגסב םינייפאמ] -f תינכת-םש [--] ץבוק-םש ... :שומיש ןפוא

source: Usage: %s [POSIX or GNU style options] [--] %cprogram%c file ...
he: %s [GNU וא POSIX ןונגסב םינייפאמ] [--] %cתינכת%c ץבוק-םש ... :שומיש ןפוא

source: -f progfile --file=progfile
he: nקובץ-תכנית=elif--t קובץ-תכנית f-t\

source: -F fs --field-separator=fs
he: nמפריד-שדות=rotarapes-dleif--t מפריד-שדות F-t\

source: -v var=val --assign=var=val
he: nערך=משתנה=ngissa--t ערך=משתנה v-t\

source: To report bugs, see node `Bugs' in `gawk.info', which is section `Reporting Problems and Bugs' in the printed version.
he: אוהש ,`gawk.info' ץבוקב `Bugs' תמוצ האר ,תולקת לע חווידל .ספדומה ךירדמב `Reporting Problems and Bugs' הקספ

source: gawk is a pattern scanning and processing language. By default it reads standard input and writes standard output.
he: .טסקט תוינבת לש דוביעו היקרסל הפש וניה gawk .ינקת טלפל בתוכו ינקת טלק ץורע ארוק אוה לדחמ תרירבכ

source: Examples: gawk '{ sum += $1 }; END { print sum }' file gawk -F: '{ print $1 }' /etc/passwd
he: דוגמאות: gawk '{ sum += $1 }; END { print sum }' file gawk -F: '{ print $1 }' /etc/passwd

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
he: ,תלעות איבת איהש הווקת ךותמ תצפומ וז תינכת עמתשמב-תוירחא אל וליפא ;תוירחא בתכ לכ אלל םלוא ,םיטרפל .תמיוסמ תילכת וזיאל המאתה וא תוריחס לש .GNU General Public License-ב ונייע אנא

source: -Ft does not set FS to tab in POSIX awk
he: tF- אינו גורם ל-SF להיות BAT בגרסת XISOP של kwa

source: floating point exception
he: חריגה בחישובי נקודה צפה

source: fatal error: internal error
he: תימינפ הנכת תאיגש :הרומח הלקת

source: no pre-opened fd %d
he: ערוץ קלט/פלט d% אינו פתוח מראש

source: could not pre-open /dev/null for fd %d
he: לא ניתן לפתוח ערוץ קלט/פלט d% ל-llun/ved/

source: could not find groups: %s
he: cmd. line:

source: backslash at end of string
he: לוכסן הפוך בסוף מחרוזת

source: POSIX does not allow `\x' escapes
he: תקן XISOP אינו מרשה סדרות בקרה מסוג 'x\`

source: no hex digits in `\x' escape sequence
he: אין להשתמש בספרות הקסדצימליות בסדרת בקרה 'x\`

source: escape sequence `\%c' treated as plain `%c'
he: תו 'c%` בסדרת בקרה 'c%\` טופל כתו מילולי

source: could not open `%s' for writing: %s
he: תקלה (%s) בעת פתיחת `%s' לצורך כתיבה

source: # gawk profile, created %s
he: nפרופיל של gawk מתאריך %s #t\

source: # Functions, listed alphabetically
he: # תיב-ףלא רדסב ,תויצקנופ

source: Success
he: הצלחה

source: No match
he: לא נמצאה מחרוזת מתאימה

source: Invalid regular expression
he: ביטוי רגולרי שגוי

source: Invalid collation character
he: תו סידור בלתי-מוגדר

source: Invalid character class name
he: שם בלתי-מוגדר של קבוצת תוים

source: Trailing backslash
he: ביטוי רגולרי מסתיים בלוכסן אחורי '\`

source: Invalid back reference
he: הפנייה שגויה לתת-ביטוי קודם

source: Unmatched [ or [^
he: [ או ^[ שאין לו בן-זוג

source: Unmatched ( or \(
he: ( או (\ שאין לו בן-זוג

source: Unmatched \{
he: {\ שאין לו בן-זוג

source: Invalid content of \{\}
he: מבנה שגוי בתוך }\{\

source: Invalid range end
he: הגדרה שגויה של תחום תוים

source: Memory exhausted
he: נגמר הזכרון

source: Invalid preceding regular expression
he: ביטוי רגולרי קודם שגוי או אינו קיים

source: Premature end of regular expression
he: ביטוי רגולרי מסתיים מוקדם מדי

source: Regular expression too big
he: ביטוי רגולרי גדול או מורכב מדי

source: Unmatched ) or \)
he: ) או )\ שאין לו בן-זוג

source: No previous regular expression
he: אין ביטוי רגולרי קודם
